ДополненияКА/src/InformationRegisters/ТоварныеОграничения/ТоварныеОграничения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="71ecd0a2-defd-4369-ab36-96a816f4a3b0">
  <name>ТоварныеОграничения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d3bf25f1-b352-4de7-a3f0-12f193d49202">
    <name>МинимальноеКоличествоЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="ced83ca4-bef3-49e6-b409-a0201f65b2a0">
    <name>МаксимальноеКоличествоЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="9fc71146-a59f-4d79-b4bf-815578a256fd">
    <name>МетодОбеспеченияПотребностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="de8da437-fd4b-4d4a-affc-10e4b76c4e6e">
    <name>ОбеспечениеЗаказовПриПоддержанииЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="0f2d5e09-a07b-4a07-b9cb-f34046545392">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="8318429d-9ef9-44fe-afe5-3c2b2cc18317">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ДополненияКА/src/Enums/МетодыОбеспеченияПотребностей/МетодыОбеспеченияПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="879216cd-58f8-4ae5-b494-20f33e3f24f9">
  <name>МетодыОбеспеченияПотребностей</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="123aad71-3991-4419-bc74-de443eb42763">
    <name>ПоддержаниеЗапасаМинМакс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ДополненияКА/src/Enums/ОбеспечениеЗаказовПриПоддержанииЗапаса/ОбеспечениеЗаказовПриПоддержанииЗапаса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="305bbad7-aef3-43ab-a970-3173f12309f4">
  <name>ОбеспечениеЗаказовПриПоддержанииЗапаса</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="c6dc4469-b326-469b-aae7-277dbcdbbf4c">
    <name>ЗаСчетЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ДополненияКА/src/CommonForms/ДКА_БыстраяУстановкаМинМакс/Module.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Возврат при получении формы для анализа
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	Номенклатура = Параметры["Номенклатура"];

	ТекстЗапроса = "ВЫБРАТЬ
				   |	ЕСТЬNULL(ТоварныеОграничения.МинимальноеКоличествоЗапаса, 0) КАК Мин,
				   |	ЕСТЬNULL(ТоварныеОграничения.МаксимальноеКоличествоЗапаса, 0) КАК Макс,
				   |	Склады.Ссылка КАК Склад,
				   |	Склады.Наименование КАК НаименованиеСклада
				   |ИЗ
				   |	Справочник.Склады КАК Склады
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
				   |		ПО ТоварныеОграничения.Склад = Склады.Ссылка
				   |		И ТоварныеОграничения.Номенклатура = &Номенклатура
				   |ГДЕ
				   |	Склады.ПометкаУдаления = ЛОЖЬ
				   |	И Склады.ЭтоГруппа = ЛОЖЬ
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	Макс УБЫВ,
				   |	НаименованиеСклада";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		СтрокаСписок = Список.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСписок, Выборка);
	КонецЦикла;

	Элементы.Список.АвтоМаксимальнаяВысота = Ложь;
	Элементы.Список.ВысотаВСтрокахТаблицы = Выборка.Количество();

	// Вызов стандартной для конфигунации обработки события
	ДКА_СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	ОчиститьСообщения();
	СохранитьИЗакрытьНаСервере();
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьИЗакрытьНаСервере()
	
	НаборЗаписей = РегистрыСведений.ТоварныеОграничения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура, Истина);
	НаборЗаписей.Записать();
	
	Для Каждого Эл Из Список Цикл
		
		Если Эл.Мин <> 0 Или Эл.Макс <> 0 Тогда
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Номенклатура = Номенклатура;
			НоваяЗапись.Склад = Эл.Склад;
			НоваяЗапись.МинимальноеКоличествоЗапаса = Эл.Мин;
			НоваяЗапись.МаксимальноеКоличествоЗапаса = Эл.Макс;
			НоваяЗапись.МетодОбеспеченияПотребностей = Перечисления.МетодыОбеспеченияПотребностей.ПоддержаниеЗапасаМинМакс;
			НоваяЗапись.ОбеспечениеЗаказовПриПоддержанииЗапаса = Перечисления.ОбеспечениеЗаказовПриПоддержанииЗапаса.ЗаСчетЗапасов;
			НоваяЗапись.Активность = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
